Tekla Open API Reference for Tekla Structures 2025
BaseLineWithArrowAtEndPointPlacingType Class
 The BaseLineWithArrowAtEndPointPlacingType class defines a placing type that places the object using the base line placing. The line is drawn and will have an arrow at the end point.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.BaseLineWithArrowAtEndPointPlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class BaseLineWithArrowAtEndPointPlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class BaseLineWithArrowAtEndPointPlacingType
	Inherits PreferredPlacingTypeBase
The BaseLineWithArrowAtEndPointPlacingType type exposes the following members.
Constructors
Name | Description
BaseLineWithArrowAtEndPointPlacingType
 Creates a new base line with arrow at end point placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace